apache/nuttx/arch/mips/src/pic32mz/pic32mz_serial.c
static struct up_dev_s g_uart1priv =
{
  .uartbase  = PIC32MZ_UART1_K1BASE,
  .baud      = CONFIG_UART1_BAUD,
  .irqe      = PIC32MZ_IRQ_U1E,
  .irqrx     = PIC32MZ_IRQ_U1RX,
  .irqtx     = PIC32MZ_IRQ_U1TX,
  .parity    = CONFIG_UART1_PARITY,
  .bits      = CONFIG_UART1_BITS,
  .stopbits2 = CONFIG_UART1_2STOP,
  .lock      = SP_UNLOCKED,

#ifdef CONFIG_PIC32MZ_UART_BREAKS
  .brk        = false,
#  ifdef CONFIG_PIC32MZ_SERIALBRK_BSDCOMPAT
  .tx_gpio    = PPS_OUTPUT_REGADDR_TO_GPIO(BOARD_U1TX_PPS)
                  | GPIO_OUTPUT | GPIO_VALUE_ZERO,
  .tx_pps_reg = PPS_OUTPUT_REGADDR(BOARD_U1TX_PPS),
  .tx_pps_val = PPS_OUTPUT_REGVAL(BOARD_U1TX_PPS),
#  endif
#endif
};

static uart_dev_t g_uart1port =
{
  .recv      =
  {
    .size    = CONFIG_UART1_RXBUFSIZE,
    .buffer  = g_uart1rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART1_TXBUFSIZE,
    .buffer  = g_uart1txbuffer,
  },
  .ops       = &g_uart_ops,
  .priv      = &g_uart1priv,
};
#endif

#ifdef CONFIG_PIC32MZ_UART2
/* This describes the state of the PIC32MZ UART2 port. */

static struct up_dev_s g_uart2priv =
{
  .uartbase  = PIC32MZ_UART2_K1BASE,
  .baud      = CONFIG_UART2_BAUD,
  .irqe      = PIC32MZ_IRQ_U2E,
  .irqrx     = PIC32MZ_IRQ_U2RX,
  .irqtx     = PIC32MZ_IRQ_U2TX,
  .parity    = CONFIG_UART2_PARITY,
  .bits      = CONFIG_UART2_BITS,
  .stopbits2 = CONFIG_UART2_2STOP,
  .lock      = SP_UNLOCKED,

#ifdef CONFIG_PIC32MZ_UART_BREAKS
  .brk        = false,
#  ifdef CONFIG_PIC32MZ_SERIALBRK_BSDCOMPAT
  .tx_gpio    = PPS_OUTPUT_REGADDR_TO_GPIO(BOARD_U2TX_PPS)
                  | GPIO_OUTPUT | GPIO_VALUE_ZERO,
  .tx_pps_reg = PPS_OUTPUT_REGADDR(BOARD_U2TX_PPS),
  .tx_pps_val = PPS_OUTPUT_REGVAL(BOARD_U2TX_PPS),
#  endif
#endif
};

static uart_dev_t g_uart2port =
{
  .recv      =
  {
    .size    = CONFIG_UART2_RXBUFSIZE,
    .buffer  = g_uart2rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART2_TXBUFSIZE,
    .buffer  = g_uart2txbuffer,
  },
  .ops       = &g_uart_ops,
  .priv      = &g_uart2priv,
};
#endif

#ifdef CONFIG_PIC32MZ_UART3
/* This describes the state of the PIC32MZ UART3 port. */

static struct up_dev_s g_uart3priv =
{
  .uartbase  = PIC32MZ_UART3_K1BASE,
  .baud      = CONFIG_UART3_BAUD,
  .irqe      = PIC32MZ_IRQ_U3E,
  .irqrx     = PIC32MZ_IRQ_U3RX,
  .irqtx     = PIC32MZ_IRQ_U3TX,
  .parity    = CONFIG_UART3_PARITY,
  .bits      = CONFIG_UART3_BITS,
  .stopbits2 = CONFIG_UART3_2STOP,
  .lock      = SP_UNLOCKED,

#ifdef CONFIG_PIC32MZ_UART_BREAKS
  .brk        = false,
#  ifdef CONFIG_PIC32MZ_SERIALBRK_BSDCOMPAT
  .tx_gpio    = PPS_OUTPUT_REGADDR_TO_GPIO(BOARD_U3TX_PPS)
                  | GPIO_OUTPUT | GPIO_VALUE_ZERO,
  .tx_pps_reg = PPS_OUTPUT_REGADDR(BOARD_U3TX_PPS),
  .tx_pps_val = PPS_OUTPUT_REGVAL(BOARD_U3TX_PPS),
#  endif
#endif
};

static uart_dev_t g_uart3port =
{
  .recv      =
  {
    .size    = CONFIG_UART3_RXBUFSIZE,
    .buffer  = g_uart3rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART3_TXBUFSIZE,
    .buffer  = g_uart3txbuffer,
  },
  .ops       = &g_uart_ops,
  .priv      = &g_uart3priv,
};
#endif

#ifdef CONFIG_PIC32MZ_UART4
/* This describes the state of the PIC32MZ UART4 port. */

static struct up_dev_s g_uart4priv =
{
  .uartbase  = PIC32MZ_UART4_K1BASE,
  .baud      = CONFIG_UART4_BAUD,
  .irqe      = PIC32MZ_IRQ_U4E,
  .irqrx     = PIC32MZ_IRQ_U4RX,
  .irqtx     = PIC32MZ_IRQ_U4TX,
  .parity    = CONFIG_UART4_PARITY,
  .bits      = CONFIG_UART4_BITS,
  .stopbits2 = CONFIG_UART4_2STOP,
  .lock      = SP_UNLOCKED,

#ifdef CONFIG_PIC32MZ_UART_BREAKS
  .brk        = false,
#  ifdef CONFIG_PIC32MZ_SERIALBRK_BSDCOMPAT
  .tx_gpio    = PPS_OUTPUT_REGADDR_TO_GPIO(BOARD_U4TX_PPS)
                  | GPIO_OUTPUT | GPIO_VALUE_ZERO,
  .tx_pps_reg = PPS_OUTPUT_REGADDR(BOARD_U4TX_PPS),
  .tx_pps_val = PPS_OUTPUT_REGVAL(BOARD_U4TX_PPS),
#  endif
#endif
};

static uart_dev_t g_uart4port =
{
  .recv      =
  {
    .size    = CONFIG_UART4_RXBUFSIZE,
    .buffer  = g_uart4rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART4_TXBUFSIZE,
    .buffer  = g_uart4txbuffer,
  },
  .ops       = &g_uart_ops,
  .priv      = &g_uart4priv,
};
#endif

#ifdef CONFIG_PIC32MZ_UART5
/* This describes the state of the PIC32MZ UART5 port. */

static struct up_dev_s g_uart5priv =
{
  .uartbase  = PIC32MZ_UART5_K1BASE,
  .baud      = CONFIG_UART5_BAUD,
  .irqe      = PIC32MZ_IRQ_U5E,
  .irqrx     = PIC32MZ_IRQ_U5RX,
  .irqtx     = PIC32MZ_IRQ_U5TX,
  .parity    = CONFIG_UART5_PARITY,
  .bits      = CONFIG_UART5_BITS,
  .stopbits2 = CONFIG_UART5_2STOP,
  .lock      = SP_UNLOCKED,

#ifdef CONFIG_PIC32MZ_UART_BREAKS
  .brk        = false,
#  ifdef CONFIG_PIC32MZ_SERIALBRK_BSDCOMPAT
  .tx_gpio    = PPS_OUTPUT_REGADDR_TO_GPIO(BOARD_U5TX_PPS)
                  | GPIO_OUTPUT | GPIO_VALUE_ZERO,
  .tx_pps_reg = PPS_OUTPUT_REGADDR(BOARD_U5TX_PPS),
  .tx_pps_val = PPS_OUTPUT_REGVAL(BOARD_U5TX_PPS),
#  endif
#endif
};

static uart_dev_t g_uart5port =
{
  .recv      =
  {
    .size    = CONFIG_UART5_RXBUFSIZE,
    .buffer  = g_uart5rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART5_TXBUFSIZE,
    .buffer  = g_uart5txbuffer,
  },
  .ops       = &g_uart_ops,
  .priv      = &g_uart5priv,
};
#endif

#ifdef CONFIG_PIC32MZ_UART6
/* This describes the state of the PIC32MZ UART6 port. */

static struct up_dev_s g_uart6priv =
{
  .uartbase  = PIC32MZ_UART6_K1BASE,
  .baud      = CONFIG_UART6_BAUD,
  .irqe      = PIC32MZ_IRQ_U6E,
  .irqrx     = PIC32MZ_IRQ_U6RX,
  .irqtx     = PIC32MZ_IRQ_U6TX,
  .parity    = CONFIG_UART6_PARITY,
  .bits      = CONFIG_UART6_BITS,
  .stopbits2 = CONFIG_UART6_2STOP,
  .lock      = SP_UNLOCKED,

#ifdef CONFIG_PIC32MZ_UART_BREAKS
  .brk        = false,
#  ifdef CONFIG_PIC32MZ_SERIALBRK_BSDCOMPAT
  .tx_gpio    = PPS_OUTPUT_REGADDR_TO_GPIO(BOARD_U6TX_PPS)
                  | GPIO_OUTPUT | GPIO_VALUE_ZERO,
  .tx_pps_reg = PPS_OUTPUT_REGADDR(BOARD_U6TX_PPS),
  .tx_pps_val = PPS_OUTPUT_REGVAL(BOARD_U6TX_PPS),
#  endif
#endif
};

static uart_dev_t g_uart6port =
{
  .recv      =
  {
    .size    = CONFIG_UART6_RXBUFSIZE,
    .buffer  = g_uart6rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART6_TXBUFSIZE,
    .buffer  = g_uart6txbuffer,
  },
  .ops       = &g_uart_ops,
  .priv      = &g_uart6priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_serialin
 ****************************************************************************/

static inline uint32_t up_serialin(struct up_dev_s *priv, int offset)
{
  return getreg32(priv->uartbase + offset);
}

/****************************************************************************
 * Name: up_serialout
 ****************************************************************************/

static inline void up_serialout(struct up_dev_s *priv, int offset,
                                uint32_t value)
{
  putreg32(value, priv->uartbase + offset);
}

/****************************************************************************
 * Name: up_restoreuartint
 ****************************************************************************/

