apache/nuttx/arch/mips/src/pic32mz/pic32mz_serial.c
          uart_xmitchars(dev);
          handled = true;

          /* Clear the pending TX interrupt if the TX FIFO is empty.
           * Note that interrupts can be lost if the interrupt condition is
           * still true when the interrupt is cleared.  Keeping the TX
           * interrupt pending too long is not a problem:  Upper level logic
           * will disable the TX interrupt when there is no longer anything
           * to be sent.
           */

          if ((up_serialin(priv, PIC32MZ_UART_STA_OFFSET) &
               UART_STA_UTRMT) != 0)
            {
              mips_clrpend_irq(priv->irqtx);
            }
        }
    }

  return OK;
}

/****************************************************************************
 * Name: up_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int up_ioctl(struct file *filep, int cmd, unsigned long arg)
{
#if defined(CONFIG_SERIAL_TERMIOS) || defined(CONFIG_SERIAL_TIOCSERGSTRUCT) \
    || defined(CONFIG_PIC32MZ_UART_BREAKS)
  struct inode      *inode = filep->f_inode;
  struct uart_dev_s *dev   = inode->i_private;
#endif
#if defined(CONFIG_SERIAL_TERMIOS) || defined(CONFIG_PIC32MZ_UART_BREAKS)
  struct up_dev_s   *priv  = (struct up_dev_s *)dev->priv;
#endif
  int                ret   = OK;

  switch (cmd)
    {
#ifdef CONFIG_SERIAL_TIOCSERGSTRUCT
    case TIOCSERGSTRUCT:
      {
         struct up_dev_s *user = (struct up_dev_s *)arg;
         if (!user)
           {
             ret = -EINVAL;
           }
         else
           {
             memcpy(user, dev, sizeof(struct up_dev_s));
           }
       }
       break;
#endif

#ifdef CONFIG_SERIAL_TERMIOS
    case TCGETS:
      {
        struct termios *termiosp = (struct termios *)arg;
        tcflag_t ccflag = 0;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        if (priv->bits >= 5 && priv->bits <= 8)
          {
            ccflag |= (CS5 + (priv->bits - 5));
          }

        if (priv->stopbits2)
          {
            ccflag |= CSTOPB;
          }

        if (priv->parity == 1)
          {
            ccflag |= PARENB;
          }
        else if (priv->parity == 2)
          {
            ccflag |= PARENB | PARODD;
          }

        /* TODO: Other termios fields are not yet returned.
         *
         * TODO: append support for CCTS_OFLOW, CRTS_IFLOW, HUPCL, and
         *       CLOCAL as well as os-compliant break sequence.
         *
         * Note that cfsetospeed is not necessary because we have
         * knowledge that only one speed is supported.
         */

        termiosp->c_cflag = ccflag;

        cfsetispeed(termiosp, priv->baud);
      }
      break;

    case TCSETS:
      {
        struct termios *termiosp = (struct termios *)arg;
        unsigned int nbits;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Perform some sanity checks before accepting any changes */

        if (termiosp->c_cflag & CRTSCTS)
          {
            /* We don't support flow control right now, so we report an
             * error
             */

            ret = -EINVAL;
            break;
          }

        nbits = (termiosp->c_cflag & CSIZE) + 5;
        if ((nbits < 8) || (nbits > 9))
          {
            /* We only support 8 or 9 data bits on this arch, so we
             * report an error
             */

            ret = -EINVAL;
            break;
          }

        /* Sanity checks passed; apply settings. */

        priv->bits = nbits;

        if (termiosp->c_cflag & PARENB)
          {
            priv->parity = (termiosp->c_cflag & PARODD) ? 1 : 2;
          }
        else
          {
            priv->parity = 0;
          }

        priv->stopbits2 = (termiosp->c_cflag & CSTOPB) != 0;

        /* TODO:  Handle other termios settings.
         * Note that only cfgetispeed is used because we have knowledge
         * that only one speed is supported.
         */

        priv->baud = cfgetispeed(termiosp);
        pic32mz_uartconfigure(priv->uartbase, priv->baud, priv->parity,
                              priv->bits, priv->stopbits2);
      }
      break;
#endif /* CONFIG_SERIAL_TERMIOS */

#ifdef CONFIG_PIC32MZ_UART_BREAKS
#  ifdef CONFIG_PIC32MZ_SERIALBRK_BSDCOMPAT
    case TIOCSBRK:  /* BSD compatibility: Turn break on, unconditionally */
      {
        irqstate_t flags;

        flags = enter_critical_section();

        /* Disable any further TX activity */

        priv->brk = true;
        up_txint(dev, false);

        /* Configure TX as a GPIO output pin driven low to send break */

        pic32mz_configgpio(priv->tx_gpio);
        putreg32(0, priv->tx_pps_reg);

        leave_critical_section(flags);
      }
      break;

    case TIOCCBRK:  /* BSD compatibility: Turn break off, unconditionally */
      {
        irqstate_t flags;

        flags = enter_critical_section();

        /* Configure TX back to UART */

        putreg32(priv->tx_pps_val, priv->tx_pps_reg);

        /* Enable further tx activity */

        priv->brk = false;
        up_txint(dev, true);

        leave_critical_section(flags);
      }
      break;
#  else
    case TIOCSBRK:  /* No BSD compatibility: Turn break on for 12 bit times */
      {
        uint32_t regval;
        irqstate_t flags;

        flags = enter_critical_section();

        /* Disable any further TX activity */

        priv->brk = true;
        up_txint(dev, false);

        /* Enable break transmission */

        regval = up_serialin(priv, PIC32MZ_UART_STA_OFFSET);
        regval |= UART_STA_UTXBRK;
        up_serialout(priv, PIC32MZ_UART_STA_OFFSET, regval);

        /* A dummy write to TXREG is needed to start sending the break. The
         * caller should ensure that there are no pending transmit data in
         * the UART FIFO before executing this IOCTL or the break will
         * consume a byte of that data instead of the dummy write.
         */

        up_send(dev, 0);

        leave_critical_section(flags);
      }
      break;

